### Handle Null Values in Pandas

Dropna() <br>
bfill() <br>
ffill() <br>
fillna() <br>

###### Detect total null values in dataframe

In [1]:
import pandas as pd

data = {'A': [1, 2, 3, 4, None, 5],
       'B': [None, 2, 3, 4, 5, None]}

df = pd.DataFrame(data)

In [2]:
df.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  5.0

In [3]:
df.isnull().sum()

A    1
B    2
dtype: int64

###### Removing Missing Values

In [4]:
df1 = df.copy()

In [5]:
df1.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  5.0

In [8]:
df1.dropna(inplace=True)

In [9]:
df1.head()

     A    B
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0

In [10]:
df2 = df.copy()

In [11]:
df2.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  5.0

In [12]:
# drop columns which has null values
df2.dropna(inplace=True, axis=1)

In [13]:
df2.head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

##### ffill()

In [14]:
df3 = df.copy()

In [15]:
df3.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  5.0

In [18]:
df3.ffill(inplace=True)

In [19]:
df3.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  4.0  5.0

In [20]:
df3.isnull().sum()

A    0
B    1
dtype: int64

##### bfill()

In [21]:
df4 = df.copy()

In [23]:
df4.bfill(inplace=True)

In [24]:
df4.head()

     A    B
0  1.0  2.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  5.0  5.0

##### fillna()

In [25]:
df5 = df.copy()

In [26]:
df5.head()

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  5.0

In [27]:
df5.mean()

A    3.0
B    3.5
dtype: float64

In [28]:
df5.fillna(df5.mean())

     A    B
0  1.0  3.5
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  3.0  5.0
5  5.0  3.5